__Chapter 2 - Data Preparation Basics__

In [2]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

_Section 1 - Filtering and Selecting Data_

__Selecting and Retrieving Data__

You can write an index value in two forms:<br>

1.) Label index <br>
2.) Integer index <br>

In [4]:
series_obj = Series(np.arange(8), index = ['row 1','row 2','row 3','row 4','row 5','row 6', 'row 7', 'row 8'])
series_obj

In [5]:
# Label index
series_obj['row 7']

6

In [7]:
# Integer index
series_obj[[0, 7]]

row 1    0
row 8    7
dtype: int32

In [10]:
np.random.seed(25)
DF_obj = DataFrame(np.random.rand(36).reshape(6,6), index = ['row 1','row 2','row 3','row 4','row 5','row 6'],
                    columns = ['column 1','column 2','column 3','column 4','column 5','column 6'])
DF_obj

       column 1  column 2  column 3  column 4  column 5  column 6
row 1  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
row 2  0.684969  0.437611  0.556229  0.367080  0.402366  0.113041
row 3  0.447031  0.585445  0.161985  0.520719  0.326051  0.699186
row 4  0.366395  0.836375  0.481343  0.516502  0.383048  0.997541
row 5  0.514244  0.559053  0.034450  0.719930  0.421004  0.436935
row 6  0.281701  0.900274  0.669612  0.456069  0.289804  0.525819

In [11]:
DF_obj.loc[['row 2', 'row 5'], ['column 5', 'column 2']]

       column 5  column 2
row 2  0.402366  0.437611
row 5  0.421004  0.559053

__Data Slicing__ <br>

Data slicing can be used to select and return a slice of several values from a data set. Slicing uses index values so you can use the same square brackets when doing data slicing. <br>

How slicing differs is that with slicing, you can pass in two index values that are separated by a colon. The index value on the left side of the colon should be the first value you want to select. On the right side of the colon, you write the index value for the last value you want to retrieve. When you execute the code, the indexer then simply finds the first record and last record and returns every record in between them.

In [12]:
series_obj['row 3': 'row 7']

row 3    2
row 4    3
row 5    4
row 6    5
row 7    6
dtype: int32

__Comparing with Scalars__ <br>
Now we're going to talk about comparison operators and scalar values. A scalar is a single numerical value. These numbers can be used with comparison operators to return true/false values for all records to indicate how each element compares to the scalar value.

In [13]:
DF_obj < .2

       column 1  column 2  column 3  column 4  column 5  column 6
row 1     False     False     False      True     False      True
row 2     False     False     False     False     False      True
row 3     False     False      True     False     False     False
row 4     False     False     False     False     False     False
row 5     False     False      True     False     False     False
row 6     False     False     False     False     False     False

__Filtering with scalars__

In [14]:
series_obj[series_obj > 6]

row 8    7
dtype: int32

__Setting values with scalars__

In [17]:
series_obj[['row 1', 'row 5', 'row 8']] = 8
series_obj

row 1    8
row 2    1
row 3    2
row 4    3
row 5    8
row 6    5
row 7    6
row 8    8
dtype: int32

Filtering and selecting using Pandas is one of the most fundamental things you will do in data analysis. Make sure you know how to use indexing to select and retreive records.

_Section 2: Treating Missing Values_

__Figuring out what data is missing__

In [3]:
missing = np.nan

series_obj = Series(['row 1','row 2', missing,'row 4','row 5','row 6', missing, 'row 8'])
series_obj

0    row 1
1    row 2
2      NaN
3    row 4
4    row 5
5    row 6
6      NaN
7    row 8
dtype: object

In [4]:
series_obj.isnull()

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7    False
dtype: bool

__Filling in for missing values__

In [6]:
np.random.seed(25)
df_obj = DataFrame(np.random.rand(36).reshape(6,6))
df_obj

          0         1         2         3         4         5
0  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
1  0.684969  0.437611  0.556229  0.367080  0.402366  0.113041
2  0.447031  0.585445  0.161985  0.520719  0.326051  0.699186
3  0.366395  0.836375  0.481343  0.516502  0.383048  0.997541
4  0.514244  0.559053  0.034450  0.719930  0.421004  0.436935
5  0.281701  0.900274  0.669612  0.456069  0.289804  0.525819

In [8]:
# Set values to NaN using .loc
df_obj.loc[3:5, 0] = missing
df_obj.loc[1:4, 5] = missing
df_obj

          0         1         2         3         4         5
0  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
1  0.684969  0.437611  0.556229  0.367080  0.402366       NaN
2  0.447031  0.585445  0.161985  0.520719  0.326051       NaN
3       NaN  0.836375  0.481343  0.516502  0.383048       NaN
4       NaN  0.559053  0.034450  0.719930  0.421004       NaN
5       NaN  0.900274  0.669612  0.456069  0.289804  0.525819

In [9]:
# Fill NaN values with 0
filled_df = df_obj.fillna(0)
filled_df

          0         1         2         3         4         5
0  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
1  0.684969  0.437611  0.556229  0.367080  0.402366  0.000000
2  0.447031  0.585445  0.161985  0.520719  0.326051  0.000000
3  0.000000  0.836375  0.481343  0.516502  0.383048  0.000000
4  0.000000  0.559053  0.034450  0.719930  0.421004  0.000000
5  0.000000  0.900274  0.669612  0.456069  0.289804  0.525819

In [10]:
# Fill NaNs with a specified value by column (dict k:v is ColumnName:NewValue)
filled_df = df_obj.fillna({0: 0.1, 5:1.25})
filled_df

          0         1         2         3         4         5
0  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
1  0.684969  0.437611  0.556229  0.367080  0.402366  1.250000
2  0.447031  0.585445  0.161985  0.520719  0.326051  1.250000
3  0.100000  0.836375  0.481343  0.516502  0.383048  1.250000
4  0.100000  0.559053  0.034450  0.719930  0.421004  1.250000
5  0.100000  0.900274  0.669612  0.456069  0.289804  0.525819

In [11]:
# Fill NaNs with the last non NaN in the column
fill_df = df_obj.fillna(method='ffill')
fill_df

          0         1         2         3         4         5
0  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
1  0.684969  0.437611  0.556229  0.367080  0.402366  0.117376
2  0.447031  0.585445  0.161985  0.520719  0.326051  0.117376
3  0.447031  0.836375  0.481343  0.516502  0.383048  0.117376
4  0.447031  0.559053  0.034450  0.719930  0.421004  0.117376
5  0.447031  0.900274  0.669612  0.456069  0.289804  0.525819

__Counting missing values__

In [12]:
np.random.seed(25)
df_obj = DataFrame(np.random.rand(36).reshape(6,6))
df_obj.loc[3:5, 0] = missing
df_obj.loc[1:4, 5] = missing
df_obj

          0         1         2         3         4         5
0  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
1  0.684969  0.437611  0.556229  0.367080  0.402366       NaN
2  0.447031  0.585445  0.161985  0.520719  0.326051       NaN
3       NaN  0.836375  0.481343  0.516502  0.383048       NaN
4       NaN  0.559053  0.034450  0.719930  0.421004       NaN
5       NaN  0.900274  0.669612  0.456069  0.289804  0.525819

In [13]:
df_obj.isnull().sum()

0    3
1    0
2    0
3    0
4    0
5    4
dtype: int64

__Filtering out missing values__

In [14]:
# Drop all rows with NaN
df_no_NaN = df_obj.dropna()
df_no_NaN

          0         1         2         3       4         5
0  0.870124  0.582277  0.278839  0.185911  0.4111  0.117376

In [15]:
# Drop all columns with NaN
df_no_NaN = df_obj.dropna(axis=1)
df_no_NaN

          1         2         3         4
0  0.582277  0.278839  0.185911  0.411100
1  0.437611  0.556229  0.367080  0.402366
2  0.585445  0.161985  0.520719  0.326051
3  0.836375  0.481343  0.516502  0.383048
4  0.559053  0.034450  0.719930  0.421004
5  0.900274  0.669612  0.456069  0.289804

_Section 3: Removing duplicates_

In [16]:
df_obj = DataFrame({'column 1': [1,1,2,2,3,3,3],
                    'column 2': ['a','a','b','b','c','c','c'],
                    'column 3': ['A','A','B','B','C','C','C']})
df_obj

   column 1 column 2 column 3
0         1        a        A
1         1        a        A
2         2        b        B
3         2        b        B
4         3        c        C
5         3        c        C
6         3        c        C

In [17]:
# Find rows that contains duplicates
df_obj.duplicated()

0    False
1     True
2    False
3     True
4    False
5     True
6     True
dtype: bool

In [18]:
# Drops rows that contain duplicates
df_obj.drop_duplicates()

   column 1 column 2 column 3
0         1        a        A
2         2        b        B
4         3        c        C

In [19]:
df_obj = DataFrame({'column 1': [1,1,2,2,3,3,3],
                    'column 2': ['a','a','b','b','c','c','c'],
                    'column 3': ['A','A','B','B','C','D','C']})
df_obj

   column 1 column 2 column 3
0         1        a        A
1         1        a        A
2         2        b        B
3         2        b        B
4         3        c        C
5         3        c        D
6         3        c        C

In [20]:
# Drop rows that contain duplicates in a specific column
df_obj.drop_duplicates(['column 3'])

   column 1 column 2 column 3
0         1        a        A
2         2        b        B
4         3        c        C
5         3        c        D

_Section 4: Concatenating and transforming data_

In [21]:
df_obj = pd.DataFrame(np.arange(36).reshape(6,6))
df_obj

    0   1   2   3   4   5
0   0   1   2   3   4   5
1   6   7   8   9  10  11
2  12  13  14  15  16  17
3  18  19  20  21  22  23
4  24  25  26  27  28  29
5  30  31  32  33  34  35

In [24]:
df_obj_2 = pd.DataFrame(np.arange(15).reshape(5,3))
df_obj_2

    0   1   2
0   0   1   2
1   3   4   5
2   6   7   8
3   9  10  11
4  12  13  14

__Concatenating data__

In [25]:
# Concatenate by adding columns (axis=1) based on the row index values
pd.concat([df_obj, df_obj_2], axis=1)

    0   1   2   3   4   5     0     1     2
0   0   1   2   3   4   5   0.0   1.0   2.0
1   6   7   8   9  10  11   3.0   4.0   5.0
2  12  13  14  15  16  17   6.0   7.0   8.0
3  18  19  20  21  22  23   9.0  10.0  11.0
4  24  25  26  27  28  29  12.0  13.0  14.0
5  30  31  32  33  34  35   NaN   NaN   NaN

In [26]:
# Concat based on column indexes by adding rows to the df
pd.concat([df_obj, df_obj_2])

    0   1   2     3     4     5
0   0   1   2   3.0   4.0   5.0
1   6   7   8   9.0  10.0  11.0
2  12  13  14  15.0  16.0  17.0
3  18  19  20  21.0  22.0  23.0
4  24  25  26  27.0  28.0  29.0
5  30  31  32  33.0  34.0  35.0
0   0   1   2   NaN   NaN   NaN
1   3   4   5   NaN   NaN   NaN
2   6   7   8   NaN   NaN   NaN
3   9  10  11   NaN   NaN   NaN
4  12  13  14   NaN   NaN   NaN

__Transforming Data__

In [27]:
# Dropping Data

In [28]:
# Drop rows 0,2
df_obj.drop([0,2])

    0   1   2   3   4   5
1   6   7   8   9  10  11
3  18  19  20  21  22  23
4  24  25  26  27  28  29
5  30  31  32  33  34  35

In [30]:
# Drop columns 0,2
df_obj.drop([0,2], axis =1)

    1   3   4   5
0   1   3   4   5
1   7   9  10  11
2  13  15  16  17
3  19  21  22  23
4  25  27  28  29
5  31  33  34  35

__Adding data__

In [31]:
series_obj = Series(np.arange(6))
series_obj.name = 'added_variable'
series_obj

0    0
1    1
2    2
3    3
4    4
5    5
Name: added_variable, dtype: int32

In [35]:
variable_added = DataFrame.join(df_obj, series_obj)
variable_added

    0   1   2   3   4   5  added_variable
0   0   1   2   3   4   5               0
1   6   7   8   9  10  11               1
2  12  13  14  15  16  17               2
3  18  19  20  21  22  23               3
4  24  25  26  27  28  29               4
5  30  31  32  33  34  35               5

In [37]:
# add dataframe to itself, don't reindex. Had to add _ to beginning of append, pandas version issue. Do not use this method if possible
added_datatable = variable_added._append(variable_added, ignore_index=False)
added_datatable

    0   1   2   3   4   5  added_variable
0   0   1   2   3   4   5               0
1   6   7   8   9  10  11               1
2  12  13  14  15  16  17               2
3  18  19  20  21  22  23               3
4  24  25  26  27  28  29               4
5  30  31  32  33  34  35               5
0   0   1   2   3   4   5               0
1   6   7   8   9  10  11               1
2  12  13  14  15  16  17               2
3  18  19  20  21  22  23               3
4  24  25  26  27  28  29               4
5  30  31  32  33  34  35               5

In [38]:
# add dataframe to itself. Reset index. Had to add _ to beginning of append, pandas version issue. Do not use this method if possible
added_datatable = variable_added._append(variable_added, ignore_index=True)
added_datatable

     0   1   2   3   4   5  added_variable
0    0   1   2   3   4   5               0
1    6   7   8   9  10  11               1
2   12  13  14  15  16  17               2
3   18  19  20  21  22  23               3
4   24  25  26  27  28  29               4
5   30  31  32  33  34  35               5
6    0   1   2   3   4   5               0
7    6   7   8   9  10  11               1
8   12  13  14  15  16  17               2
9   18  19  20  21  22  23               3
10  24  25  26  27  28  29               4
11  30  31  32  33  34  35               5

__Sorting Data__

In [40]:
# Sort dataframe by values in column 5 in descending order
df_sorted = df_obj.sort_values(by=(5),ascending=[False])
df_sorted

    0   1   2   3   4   5
5  30  31  32  33  34  35
4  24  25  26  27  28  29
3  18  19  20  21  22  23
2  12  13  14  15  16  17
1   6   7   8   9  10  11
0   0   1   2   3   4   5

_Section 5: Grouping and Aggregation_

__Grouping data by column index__

In [63]:
address = r'C:\Users\tyler\Python\datasci_course\Ex_Files_Python_Data_Science_EssT_Pt_1\Exercise Files\Data\mtcars.csv'

cars = pd.read_csv(address)

cars.columns = ['car_names', 'mpg', 'cyl', 'disp', 'hp', 'drat', 'wt', 'qsec', 'vs', 'am', 'gear', 'carb']
cars.head()

,car_names,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
3,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
4,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2

In [64]:
# Group by cylinders, find the mean of the rest of the data
# This line is needed to avoid an error. You cannot take the mean of the car names, so they must be removed prior to running the next code
cars = cars.drop(['car_names'], axis=1)
cars_groups = cars.groupby(cars['cyl'])
cars_groups.mean()

,mpg,disp,hp,drat,wt,qsec,vs,am,gear,carb
cyl,,,,,,,,,,
4,26.663636,105.136364,82.636364,4.070909,2.285727,19.137273,0.909091,0.727273,4.090909,1.545455
6,19.742857,183.314286,122.285714,3.585714,3.117143,17.977143,0.571429,0.428571,3.857143,3.428571
8,15.100000,353.100000,209.214286,3.229286,3.999214,16.772143,0.000000,0.142857,3.285714,3.500000

__Chapter Quiz__

Using the mtcars dataset, group the data by the transmission type "am". Which transmission type has the highest mean miles/(US) gallon "mpg" and its corresponding value?

In [89]:
address = r'C:\Users\tyler\Python\datasci_course\Ex_Files_Python_Data_Science_EssT_Pt_1\Exercise Files\Data\mtcars.csv'

cars = pd.read_csv(address)

cars.columns = ['car_names', 'mpg', 'cyl', 'disp', 'hp', 'drat', 'wt', 'qsec', 'vs', 'am', 'gear', 'carb']
cars = cars.drop(['car_names'], axis=1)

cars.head()

    mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear  carb
0  21.0    6  160.0  110  3.90  2.620  16.46   0   1     4     4
1  21.0    6  160.0  110  3.90  2.875  17.02   0   1     4     4
2  22.8    4  108.0   93  3.85  2.320  18.61   1   1     4     1
3  21.4    6  258.0  110  3.08  3.215  19.44   1   0     3     1
4  18.7    8  360.0  175  3.15  3.440  17.02   0   0     3     2

In [90]:
am = cars.groupby(cars['am'])
am.mean()

,mpg,cyl,disp,hp,drat,wt,qsec,vs,gear,carb
am,,,,,,,,,,
0,17.147368,6.947368,290.378947,160.263158,3.286316,3.768895,18.183158,0.368421,3.210526,2.736842
1,24.392308,5.076923,143.530769,126.846154,4.050000,2.411000,17.360000,0.538462,4.384615,2.923077

Given a 5x5 dataframe, x_NaN, what is the code used to count the number of missing values per column and then subsequently drop those columns containing missing values?

In [93]:
df_obj = pd.DataFrame(np.arange(25).reshape(5,5))
df_obj.loc[3:5, 0] = missing
df_obj.loc[1:4, 5] = missing
df_obj

      0   1   2   3   4   5
0   0.0   1   2   3   4 NaN
1   5.0   6   7   8   9 NaN
2  10.0  11  12  13  14 NaN
3   NaN  16  17  18  19 NaN
4   NaN  21  22  23  24 NaN

In [95]:
# Gets count of NaN for the data frame
df_obj.isnull().sum()

0    2
1    0
2    0
3    0
4    0
5    5
dtype: int64

In [97]:
# Drops columns with missing values
df_obj_drop = df_obj.dropna(axis = 1)
df_obj_drop

    1   2   3   4
0   1   2   3   4
1   6   7   8   9
2  11  12  13  14
3  16  17  18  19
4  21  22  23  24

What is the output after concatenating dataframes, df_1 and df_2?

df_1 = np.array([[1.,3.,4.],[2.,5.,2.],[0.,4.,1.]])' and 'df_2 =np. array([[2.,1.],[0.,5.],[4.,7.]])

In [99]:
df_1 = np.array([[1.,3.,4.],[2.,5.,2.],[0.,4.,1.]])
df_2 = np.array([[2.,1.],[0.,5.],[4.,7.]])

In [103]:
pd.concat([DataFrame(df_1), DataFrame(df_2)])

     0    1    2
0  1.0  3.0  4.0
1  2.0  5.0  2.0
2  0.0  4.0  1.0
0  2.0  1.0  NaN
1  0.0  5.0  NaN
2  4.0  7.0  NaN

How would you print all the individuals in the dataframe who are younger than age 25 given a dataframe, age_obj, containing the ages of 11 individuals?

In [107]:
ages = {'Mike':26, 'John': 13, 'Luke': 45, 'Matt': 61, 'Martha': 24, 'Jane': 17,
                      'Joan': 19, 'Karen': 42, 'Tyler': 26, 'Bailey': 27, 'Zelda': 4}
age_obj = DataFrame(ages.items(), columns = ['Name', 'Age'])
age_obj

      Name  Age
0     Mike   26
1     John   13
2     Luke   45
3     Matt   61
4   Martha   24
5     Jane   17
6     Joan   19
7    Karen   42
8    Tyler   26
9   Bailey   27
10   Zelda    4

In [109]:
age_obj[age_obj['Age'] < 25]

      Name  Age
1     John   13
4   Martha   24
5     Jane   17
6     Joan   19
10   Zelda    4

Using the data frame, df_random, what is the code used to return true/false values for all records that are less than 0.4?

In [111]:
np.random.seed(25)
df_random = DataFrame(np.random.rand(36).reshape(6,6))
df_random

          0         1         2         3         4         5
0  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
1  0.684969  0.437611  0.556229  0.367080  0.402366  0.113041
2  0.447031  0.585445  0.161985  0.520719  0.326051  0.699186
3  0.366395  0.836375  0.481343  0.516502  0.383048  0.997541
4  0.514244  0.559053  0.034450  0.719930  0.421004  0.436935
5  0.281701  0.900274  0.669612  0.456069  0.289804  0.525819

In [113]:
df_random<0.4

       0      1      2      3      4      5
0  False  False   True   True  False   True
1  False  False  False   True  False   True
2  False  False   True  False   True  False
3   True  False  False  False   True  False
4  False  False   True  False  False  False
5   True  False  False  False   True  False

What is the difference between concatenation and transformation?

Concatenation is combining data from separate sources and transformation is converting and reformatting data to the necessary format in preparation for analysis.

How do you drop duplicates in column 4 of the 5x5 dataframe, x_obj, and save the new dataframe as x_no_dups?

In [122]:
x_obj = pd.DataFrame(np.arange(25).reshape(5,5))
x_obj.loc[3:5, 0] = 4
x_obj.loc[1:4, 4] = 6
x_obj.columns = ['Column 0', 'Column 1','Column 2','Column 3','Column 4']
x_obj

   Column 0  Column 1  Column 2  Column 3  Column 4
0         0         1         2         3         4
1         5         6         7         8         6
2        10        11        12        13         6
3         4        16        17        18         6
4         4        21        22        23         6

In [124]:
x_no_dups = x_obj.drop_duplicates(['Column 4'])
x_no_dups

   Column 0  Column 1  Column 2  Column 3  Column 4
0         0         1         2         3         4
1         5         6         7         8         6

What is the purpose of the drop_duplicates function?

to drop duplicates by row values

What is the code used to fill in the missing values in index position 2 with a value of 9, given a dataset, df?

In [126]:
x=df_random.fillna({2:9})

What does the isnull() function mean?

Detects NaN values. The isnull() command returns a dataframe of boolean values which are true for NaN values and false otherwise.